{
	"COLLEGE PROFESSOR":["One of my biggest joys when taking in software delopment was helping others venture into this field with me. Thus I have invested a fairly big part of my career into aiding others and providing guidance/mentoring, this has led me down many paths, I have taught all the way up from college seniors down to highschool freshmen, mostly focusing on the former, I have accumulated expirience teaching various college courses, ranging from functional programming to differential calculus. My most recent position as of Q2-2022 is a programming instructor at CodeWizardsHQ","https://www.codewizardshq.com/"]
	,"DATA ENGINEER":["One of the biggest parts of my skillset has to be my knowledge and dedication to the field of data in all it's aspects, mainly focusing on the engineering and analytical parts of the field. Having used many different set of tools, I have been able to garner a pretty diverse array of skills, these come from: 1-[Google's cloud platform, big query and nosql DB Firebase], 2-[Amazon's AWS, aka LAMDA, EC2, Elastic beanstalk, Dynamo db, and S3 buckets among other tools] 3-[MYSQL,MongoDB], 4-[Selenium,BS4], 5-[Virtualization tech such as Docker],among others. One of my flagship projects is a data scraper, which automatically parses through the website (dynamically) CoinMarketCap, evading their security measures and acquiring live data straight from their website, and afterwards sanitizing and sending the data to a MySQL server, skipping over the hassle of having to use a third party api.","https://github.com/Gohostieee/coinMarketCap-data-manipulation"]
	,"API ENGINEER":["When I first started coding, my efforts were deadset on working with data and becoming a data engineer. With such a goal I often found myself pondering what to do, creating database after database, not creating anything that I could properly publish and serve the public directly. So after pondering for a while I decided to get into API development, which at the time was something I only had a vague understanding off. This lead me to grow hugely as a devloper and helped me better understand how the APIS I was already using were structured, and create better and more organized systems for any project I wanted to create, where as before this venture I would have probably queried a DB directly If I ever needed anything, nowadays I ofcourse create a general purpose api, inorder to streamline my projects and make everything alot more efficient. I mostly use Python/Flask when dealing with heavily DB focused APIS and Node.js when I have to create any sort of api to handle calls from my websites, especially those having to do with sockets. Here's a little public snippet of a private API I am currently working on.","https://github.com/Gohostieee/Finance"]
	,"FULLSTACK DEVELOPER":["Steered management of both back-end and front-end facets of development process. Facilitate team debug and deploy fixes as per customer feedback and software performance. Design effective project roadmaps by receiving and refining concepts as per requirements. Provide end-to-end service to accomplish set goals. Automated client server creation through establishment of REST API to consume front-end form data, while interacting with Kubernetes cluster.","https://penroze.gg/"]
	,"FULLSTACK DEVELOPER-B":["Fostered strong coordination regarding system installations, testing, and code corrections. Created robust project roadmaps by acquiring and optimizing concepts. • Ensured completion of several key tasks in JavaScript for web development and dart for mobile development.",""]
	,"FULLSTACK DEVELOPER-C":["After becoming a data engineer, the next itch that I needed to satisfy was web development. I had already dawdled with web development in the past mainly working with Django, but I didn't get seriouly into it for quite a bit. After a while however I just felt like I was missing out too much by limiting myself, and decided to take on the full blunt of proper fullstack engineering, which wasn't that bad to begin with due to the fact I already had the backend nailed down. I started out with basic HTML/CSS mixed with JQUERY(mostly for AJAX calls and the occasional DOM manipulation) and Flask/Django as the backend, however with time I started leaning more and more on Javascript, and began to specialized in the REACT framework(which I personally really like, it has it's 'quirks' but I think alot of the flak it gets is undeserved), with which this website is built on! As of the moment of writing this 6/8/2022 I still havent made it, but soon enough I shall have a video going into detail about how I built this website(I have decided to keep the repo private, atleast for now). For now take a peek at this relatively old project of mine, a Flask, socket-based, chatapp, using various AWS services.","https://github.com/Gohostieee/FlaskChatApp"]


}